sergz72/ARM/mspm0g350x/ti/driverlib/dl_aesadv.h
    return (DL_AESADV_DIR)(direction);
}

/**
 *  @brief Sets the key size of the AESADV peripheral
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] size         Key Size. One of @ref DL_AESADV_KEY_SIZE.
 */
__STATIC_INLINE void DL_AESADV_setKeySize(
    AESADV_Regs *aesadv, DL_AESADV_KEY_SIZE size)
{
    DL_Common_updateReg(
        &aesadv->CTRL, (uint32_t) size, AESADV_CTRL_KEYSIZE_MASK);
}

/**
 *  @brief Returns the current key size of the AESADV peripheral
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @return one of @ref DL_AESADV_KEY_SIZE.
 */
__STATIC_INLINE DL_AESADV_KEY_SIZE DL_AESADV_getKeySize(AESADV_Regs *aesadv)
{
    uint32_t keySize = (aesadv->CTRL & AESADV_CTRL_KEYSIZE_MASK);

    return (DL_AESADV_KEY_SIZE)(keySize);
}

/**
 *  @brief Sets the AES algorithm mode
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] mode         Algorithm Mode. One of @ref DL_AESADV_MODE.
 *
 *  @note Selecting GCM as a mode requires an additional selection of the GHASH
 *        parameters expected. Please refer to the TRM for more information.
 *  @note Due to the dual use of the OFB/gcm_ccm_continue_aad bit field, if the
 *        resumption of the AAD phase of a GCM/CCM operation is desired, it must
 *        be set with the mode using @ref DL_AESADV_resumeAADPhase, for the bit
 *        will be cleared in this function
 *
 *  @sa   DL_AESADV_resumeAADPhase
 */
__STATIC_INLINE void DL_AESADV_setMode(
    AESADV_Regs *aesadv, DL_AESADV_MODE mode)
{
    DL_Common_updateReg(&aesadv->CTRL, (uint32_t) mode, DL_AESADV_MODE_MASK);
}

/**
 *  @brief Returns the current selected mode
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @return one of @ref DL_AESADV_MODE.
 *
 *  @note upon resumption of a AAD phase of operation, the dual-purpose
 *        bit of continue AAD/OFB will be read as one. In this case, the mode
 *        must be set again for a valid value to be read.
 *
 *  @sa DL_AESADV_setMode
 */
__STATIC_INLINE DL_AESADV_MODE DL_AESADV_getMode(AESADV_Regs *aesadv)
{
    uint32_t mode = (aesadv->CTRL & DL_AESADV_MODE_MASK);
    return (DL_AESADV_MODE)(mode);
}

/**
 *  @brief Sets the feedback width of the AESADV peripheral
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] fbWidth      Feedback Width. One of @ref DL_AESADV_FB_WIDTH.
 *
 *  @note this is only applicable in cipher feeback mode (CFB). OFB always has
 *        width 128.
 */
__STATIC_INLINE void DL_AESADV_setFeedbackWidth(
    AESADV_Regs *aesadv, DL_AESADV_FB_WIDTH fbWidth)
{
    DL_Common_updateReg(
        &aesadv->CTRL, (uint32_t) fbWidth, AESADV_CTRL_CTR_WIDTH_MASK);
}

/**
 *  @brief Returns the current feedback width
 *
 *  @param[in] aesadv        Pointer to the register overlay for the peripheral
 *
 *  @return one of @ref DL_AESADV_FB_WIDTH.
 *
 *  @sa DL_AESADV_setFeedbackWidth
 */
__STATIC_INLINE DL_AESADV_FB_WIDTH DL_AESADV_getFeedbackWidth(
    AESADV_Regs *aesadv)
{
    uint32_t fbWidth = (aesadv->CTRL & AESADV_CTRL_CTR_WIDTH_MASK);

    return (DL_AESADV_FB_WIDTH)(fbWidth);
}

/**
 *  @brief Sets the counter width of the AESADV peripheral
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] ctrWidth     Counter Width. One of @ref DL_AESADV_CTR_WIDTH.
 *
 *  @note this is only applicable in modes CTR, CCM
 *  @note GCM restricts counter width to 32-bits, which is not required to be
 *        set.
 *  @note if using CCM, the counter width must be wide enough to accommodate the
 *        chosen CCM length, one of @ref DL_AESADV_CCM_CTR_WIDTH (in bytes)
 *
 *  @sa DL_AESADV_setCCMCounterWidth
 */
__STATIC_INLINE void DL_AESADV_setCounterWidth(
    AESADV_Regs *aesadv, DL_AESADV_CTR_WIDTH ctrWidth)
{
    DL_Common_updateReg(
        &aesadv->CTRL, (uint32_t) ctrWidth, AESADV_CTRL_CTR_WIDTH_MASK);
}

/**
 *  @brief Returns the current counter width
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @return one of @ref DL_AESADV_CTR_WIDTH.
 *
 *  @sa DL_AESADV_setCounterWidth
 */
__STATIC_INLINE DL_AESADV_CTR_WIDTH DL_AESADV_getCounterWidth(
    AESADV_Regs *aesadv)
{
    uint32_t ctrWidth = (aesadv->CTRL & AESADV_CTRL_CTR_WIDTH_MASK);

    return (DL_AESADV_CTR_WIDTH)(ctrWidth);
}

/**
 *  @brief Sets the CCM counter width of the AESADV peripheral
 *
 *  Counter with CBC-MAC (CCM) Specific. Sets the width of the counter field
 *  that is loaded into the initialization vector along with the nonce. This
 *  signal is sometimes referred to as CCM-L. The nonce can be calculated via
 *  the following table:
 *
 *  DL_AESADV_CCM_CTR_WIDTH (bytes) | Nonce Array Length Required (bytes)
 *  --------------------------------|-------------------------------------
 *              2                   |                13
 *              3                   |                12
 *              4                   |                11
 *              5                   |                10
 *              6                   |                 9
 *              7                   |                 8
 *              8                   |                 7
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] ccm_ctrWidth Counter Width. One of @ref DL_AESADV_CCM_CTR_WIDTH
 *
 *  @note this is only applicable in modes CCM
 *  @note The general counter width must be wide enough to accommodate the
 *        chosen CCM counter width, one of @ref DL_AESADV_CTR_WIDTH (in bits). A
 *        counter width of 64-bits is sufficient to cover all cases.
 *
 *  @sa DL_AESADV_setCounterWidth
 *  @sa DL_AESADV_loadCCMNonceAndCounter
 */
__STATIC_INLINE void DL_AESADV_setCCMCounterWidth(
    AESADV_Regs *aesadv, DL_AESADV_CCM_CTR_WIDTH ccm_ctrWidth)
{
    DL_Common_updateReg(
        &aesadv->CTRL, (uint32_t) ccm_ctrWidth, AESADV_CTRL_CCML_MASK);
}

/**
 *  @brief Returns the current CCM-specific counter width
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @return one of @ref DL_AESADV_CCM_CTR_WIDTH.
 *
 *  @sa DL_AESADV_setCCMCounterWidth
 */
__STATIC_INLINE DL_AESADV_CCM_CTR_WIDTH DL_AESADV_getCCMCounterWidth(
    AESADV_Regs *aesadv)
{
    uint32_t ccm_ctrWidth = (aesadv->CTRL & AESADV_CTRL_CCML_MASK);

    return (DL_AESADV_CCM_CTR_WIDTH)(ccm_ctrWidth);
}

/**
 *  @brief Sets the CCM authentication tag width of the AESADV peripheral
 *
 *  Counter with CBC-MAC (CCM) Specific. Sets the width of the authentication
 *  field that is retrieved upon completion of the operation. The first bytes
 *  of the calculated tag will be returned, and the rest of the tag ignored.
 *  This signal is sometimes referred to as CCM-M.
 *      The full-width tag will still be calculated, just the least-significant
 *  bits will be used as according to this setting.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] ccm_tagWidth Tag Width. One of @ref DL_AESADV_CCM_TAG_WIDTH.
 */
__STATIC_INLINE void DL_AESADV_setCCMTagWidth(
    AESADV_Regs *aesadv, DL_AESADV_CCM_TAG_WIDTH ccm_tagWidth)
{
    DL_Common_updateReg(
        &aesadv->CTRL, (uint32_t) ccm_tagWidth, AESADV_CTRL_CCMM_MASK);
}

/**
 *  @brief Returns the current CCM-specific authentication tag width
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @return one of @ref DL_AESADV_CCM_TAG_WIDTH.
 *
 *  @sa DL_AESADV_setCCMTagWidth
 */
__STATIC_INLINE DL_AESADV_CCM_TAG_WIDTH DL_AESADV_getCCMTagWidth(
    AESADV_Regs *aesadv)
{
    uint32_t ccm_tagWidth = (aesadv->CTRL & AESADV_CTRL_CCMM_MASK);

    return (DL_AESADV_CCM_TAG_WIDTH)(ccm_tagWidth);
}

/**
 *  @brief  Halt operation and generate intermediate Digest for CCM/GCM
 *
 *  Specific to a multi-block CCM/GCM mode. This will interrupt processing at
 *  the boundary of a full AES block (128-bits or 16 bytes) and prepare an
 *  intermediate digest that can be used to resume operations.
 *      If the user is still inputting additional authentication data (AAD), the
 *  operation shall be resumed in the AAD phase. If the user is inputting
 *  payload data (ciphertext/plaintext), the operation shall be resumed in the
 *  data phase.
 *      The user is responsible for reading and saving the intermediate digest
 *  to preserve the state for a future resumption of the Operation.
 *      The user must have at least 1 or more bytes of additional information
 *  that needs to be inputted in order for a halt to occur.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_haltOperationAndGenerateDigest(
    AESADV_Regs *aesadv)
{
    aesadv->CTRL |= AESADV_CTRL_GET_DIGEST_ENABLE;
}

/**
 *  @brief Resume GCM or CCM operation in the AAD phase
 *
 *  Specific to a multi-block CCM/GCM mode that contains Additional
 *  Authentication Data to be written after an operation has been halted. This
 *  operation should be performed last, after the entire digest for the example
 *  has been added. The mode is written in conjunction with the resumption
 *  signal, so it must be provided.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] mode         A supported GCM or CCM mode from @ref DL_AESADV_MODE
 *
 *  @sa DL_AESADV_haltOperationAndReturnDigest
 *  @sa DL_AESADV_resumeDataPhase
 */
__STATIC_INLINE void DL_AESADV_resumeAADPhase(
    AESADV_Regs *aesadv, DL_AESADV_MODE mode)
{
    DL_Common_updateReg(&aesadv->CTRL,
        (((uint32_t) mode) |
            ((uint32_t) AESADV_CTRL_OFB_GCM_CCM_CONT_GCM_CCM_CONTINUE)),
        (DL_AESADV_MODE_MASK | AESADV_CTRL_OFB_GCM_CCM_CONT_MASK));
}

/**
 *  @brief Resume GCM or CCM operation in the Data phase
 *
 *  Specific to a multi-block CCM/GCM mode that contains additional Payload Data
 *  (ciphertext/plaintext) to be written after an operation has been halted, and
 *  any and all AAD has already been written before the time of halting. This
 *  operation should be performed last, after the entire digest for the example
 *  has been added. The mode is written in conjunction with the resumption
 *  signal, so it must be provided.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] mode         A supported GCM or CCM mode from @ref DL_AESADV_MODE
 *
 *  @sa DL_AESADV_haltOperationAndReturnDigest
 *  @sa DL_AESADV_resumeAADPhase
 */
__STATIC_INLINE void DL_AESADV_resumeDataPhase(
    AESADV_Regs *aesadv, DL_AESADV_MODE mode)
{
    DL_Common_updateReg(&aesadv->CTRL,
        ((uint32_t) mode | AESADV_CTRL_GCM_CONT_ENABLE),
        ((uint32_t) DL_AESADV_MODE_MASK | AESADV_CTRL_GCM_CONT_MASK));
}

/**
 *  @brief Enables the storage and return of a tag or result IV
 *
 *  Set if a given configuration must require an authentication TAG or result IV
 *  to be stored as part of the result context. This will trigger the context
 *  output DMA or interrupt assertion after operation completion. Additionally,
 *  the saved context ready will now be set high. Th engine will retain the
 *  registers until they have been read. Only after an associated TAG/IV has
 *  been read will a new DMA request for an input context be sent.
 *      Typically, this is set when methods return a TAG (GCM, CCM, CBCMAC) or
 *  in case an IV is to be returned for a future continued operation (CBC, CTR,
 *  etc.).
 *      If not set, the engine will assert a DMA request with the current
 *  context.
 *
 * @param[in] aesadv       Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_enableSavedOutputContext(AESADV_Regs *aesadv)
{
    aesadv->CTRL |= AESADV_CTRL_SAVE_CNTXT_ENABLE;
}

/**
 *  @brief Disables the storage and return of a tag or result IV
 *
 *  Set if a given configuration must require an authentication TAG or result IV
 *  to be stored as part of the result context. This will trigger the context
 *  output DMA or interrupt assertion after operation completion. Additionally,
 *  the saved context ready will now be set high. Th engine will retain the
 *  registers until they have been read.
 *      Typically, this is set when methods return a TAG (GCM, CCM, CBCMAC) or
 *  in case an IV is to be returned for a future continued operation (CBC, CTR,
 *  etc.).
 *      If not set, the engine will assert a DMA request with the current
 *  context.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_disableSavedOutputContext(AESADV_Regs *aesadv)
{
    aesadv->CTRL &= ~(AESADV_CTRL_SAVE_CNTXT_ENABLE);
}

/**
 *  @brief Returns whether the storage of additional context is enabled
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @retval true   Saved Output Context is enabled.
 *  @retval false  Saved Output Context is disabled.
 *
 *  @sa DL_AESADV_enableSavedOutputContext
 */
__STATIC_INLINE bool DL_AESADV_isSavedOutputContextEnabled(AESADV_Regs *aesadv)
{
    return ((aesadv->CTRL & AESADV_CTRL_SAVE_CNTXT_MASK) ==
            AESADV_CTRL_SAVE_CNTXT_ENABLE);
}

/**
 *  @brief Returns whether additional output context is available to be read
 *
 *  At the end of an operation, if additional result information to the
 *  ciphertext/plaintext is available such as TAG/IV(s), this will return true.
 *  If this value is high, then the context cannot be written.
 *
 *  @param[in] aesadv        Pointer to the register overlay for the peripheral
 *
 *  @retval true   Saved Output Context is ready to be retrieved.
 *  @retval false  Saved Output Context is unavailable.
 *
 *  @sa DL_AESADV_enableSavedOutputContext
 */
__STATIC_INLINE bool DL_AESADV_isSavedOutputContextReady(AESADV_Regs *aesadv)
{
    return ((aesadv->CTRL & AESADV_CTRL_SAVED_CNTXT_RDY_MASK) ==
            AESADV_CTRL_SAVED_CNTXT_RDY_READY);
}

/**
 *  @brief Returns whether the input context can be written by the application.
 *
 *  Determines if the context (mode, IV, key, etc.) can be modified from its
 *  current state in the application by reading the CNTXT_RDY bit. This does not
 *  mean that a previous operation has necessarily finished, just that a new
 *  context may be written. Writing a new context before completion of the
 *  current context will cancel the current operation.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @retval true   Context can be safely written to by the application
 *  @retval false  Context cannot be written, AES Authentication TAGs or IV's
 *                 are available and must be read before context can be
 *                 interrupted
 */
__STATIC_INLINE bool DL_AESADV_isInputContextWriteable(AESADV_Regs *aesadv)
{
    return ((aesadv->CTRL & AESADV_CTRL_CNTXT_RDY_MASK) ==
            AESADV_CTRL_CNTXT_RDY_READY);
}

/**
 *  @brief Sets the lower 32 bits of the crypto input data length in bytes
 *
 *  The entire length of crypto input data that can be provided is 61-bits long,
 *  and is thus set in two separate functions. The lower 32-bits will be set and
 *  decremented as the operation continues.
 *      Setting the crypto length to 0 for basic modes (CBC, CTR, ICM, CFB, OFB)
 *  will configure the AESADV module to expect an infinite input stream for the
 *  device.
 *      For GCM and CCM, this mode does not include Additional Authentication
 *  Data, this is set separately. If there is a positive AAD length, it is not
 *  required for this register to have a nonzero value.
 *      Reads from this register return all zeros, so reads are not necessary.
 *      For modes that do not allow partial blocks such as CBC, this number must
 *   be a multiple of 16.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] lowerLength  Lower 32-bits of crypto data length that will be
 *                          inputted
 *
 *  @note This sets the context for the register, and thus should be called last
 *        in the configuration for non-combined modes
 *
 *  @sa DL_AESADV_setUpperCryptoLength
 *  @sa DL_AESADV_setAADLength
 */
__STATIC_INLINE void DL_AESADV_setLowerCryptoLength(
    AESADV_Regs *aesadv, uint32_t lowerLength)
{
    aesadv->C_LENGTH_0 = lowerLength;
}

/**
 *  @brief Sets the upper 29 bits of the crypto input data length in bytes
 *
 *  The entire length of crypto input data that can be provided is 61-bits long,
 *  and is thus set in two separate functions. The upper 29-bits will be set in
 *  this function should a length larger than or equal to 2^32 be necessary.
 *  Bits 29-31 are to be zeroed out upon a write.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] upperLength  Upper 29 bits of the crypto data length in bytes
 *                          that will be inputted
 *
 *  @note This sets the context for the register in combined modes (GCM/CCM),
 *        and thus should be called last in the configuration
 *
 *  @sa DL_AESADV_setLowerCryptoLength
 */
__STATIC_INLINE void DL_AESADV_setUpperCryptoLength(
    AESADV_Regs *aesadv, uint32_t upperLength)
{
    aesadv->C_LENGTH_1 = upperLength & 0x1FFFFFFFU;
}

/**
 *  @brief Sets the length of additional authentication data (AAD)
 *
 *  Specific to CCM/GCM modes. Sets length of AAD for these modes and 0
 *  otherwise. Can be zero if no AAD, or can be nonzero with a zero crypto
 *  length for authentication-only operation. A write to this register triggers
 *  the engine to start the context, and should be written after Crypto Length.
 *      For GCM this can be any value < 2^32, for CCM this value must be less
 *  than 2^16 - 2^8.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] aadLength    length of AAD in bytes.
 *
 *  @sa DL_AESADV_setLowerLength
 */
__STATIC_INLINE void DL_AESADV_setAADLength(
    AESADV_Regs *aesadv, uint32_t aadLength)
{
    aesadv->AAD_LENGTH = aadLength;
}

/**
 *  @brief Enables DMA Operation for the AESADV module
 *
 *  Sets the AESADV module to run with Data Inputs using the DMA to read/write
 *  data rather than using register input/output
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @sa DL_AESADV_disableDMAOperation
 */
__STATIC_INLINE void DL_AESADV_enableDMAOperation(AESADV_Regs *aesadv)
{
    aesadv->DMA_HS = (AESADV_DMA_HS_DMA_DATA_ACK_DMA_ENABLE);
}

/**
 *  @brief Disables DMA Operation for the AESADV module
 *
 *  Default behavior. Sets the AESADV module to run using register input output
 *  with data provided by the CPU rather than using the DMA
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_disableDMAOperation(AESADV_Regs *aesadv)
{
    aesadv->DMA_HS = (AESADV_DMA_HS_DMA_DATA_ACK_DMA_DISABLE);
}

/**
 *  @brief Returns if DMA Operation is enabled
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @retval true   Configured to read/write data using the DMA
 *  @retval false  Configured to read/write data using the CPU (Default)
 */
__STATIC_INLINE bool DL_AESADV_isDMAOperationEnabled(AESADV_Regs *aesadv)
{
    return ((aesadv->DMA_HS & AESADV_DMA_HS_DMA_DATA_ACK_MASK) ==
            AESADV_DMA_HS_DMA_DATA_ACK_DMA_ENABLE);
}

/**
 *  @brief Returns if User Writes to the Key Registers on the AESADV are allowed
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @retval true   User Writes to the Key Registers are allowed
 *  @retval false  The user cannot write to the Key Registers
 *
 *  @note If user key writes are disabled but desired, a module reset is
 *        required
 */
__STATIC_INLINE bool DL_AESADV_isUserKeyWriteEnabled(AESADV_Regs *aesadv)
{
    return ((aesadv->STATUS & AESADV_STATUS_KEYWR_MASK) ==
            AESADV_STATUS_KEYWR_ENABLED);
}

/**
 *  @brief Loads a 128 or 256 bit regular key to the AESADV module
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] key          Pointer to an uint8_t array with a length that
 *                          contains the cipher key
 *  @param[in] keySize      Key Size. One of @ref DL_AESADV_KEY_SIZE
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AESADV_STATUS.
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AESADV_setKeyAligned
 */
DL_AESADV_STATUS DL_AESADV_setKey(
    AESADV_Regs *aesadv, const uint8_t *key, DL_AESADV_KEY_SIZE keySize);

/**
 *  @brief Loads a 128 or 256 bit regular key to the AESADV module
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] keyAligned   Pointer to an uint32_t array with a length that
 *                          contains the cipher key
 *  @param[in] keySize      Key Size. One of @ref DL_AESADV_KEY_SIZE
 *
 *  @sa DL_AESADV_setKey
 */
void DL_AESADV_setKeyAligned(AESADV_Regs *aesadv, const uint32_t *keyAligned,
    DL_AESADV_KEY_SIZE keySize);

/**
 *  @brief set the hash key
 *
 *  GCM-Specific. Sets the GHASH Hash key (sometimes referred to as H) if in
 *  a GCM mode other than DL_AESADV_MODE_GCM_AUTONOMOUS.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] hashKey      Pointer to an uint8_t array of length 16 that
 *                          contains the hash key
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AESADV_STATUS.
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AESADV_setGCMHashKeyAligned
 */
DL_AESADV_STATUS DL_AESADV_setGCMHashKey(
    AESADV_Regs *aesadv, const uint8_t *hashKey);

/**
 *  @brief set the hash key
 *
 *  GCM-Specific. Sets the GHASH Hash key (sometimes referred to as H) if in
 *  a GCM mode other than DL_AESADV_MODE_GCM_AUTONOMOUS.
 *
 *  @param[in] aesadv         Pointer to the register overlay for the peripheral
 *  @param[in] hashKeyAligned Pointer to an uint32_t array of length 4 that
 *                            contains the hash key
 *
 *  @sa DL_AESADV_setGCMHashKey
 *
 */
void DL_AESADV_setGCMHashKeyAligned(
    AESADV_Regs *aesadv, const uint32_t *hashKeyAligned);

