sergz72/ARM/mspm0g350x/ti/driverlib/dl_aesadv.h
/**
 *  @brief      Check interrupt flag of any AESADV interrupts
 *
 *  Checks if any of the AESADV interrupts are pending. Interrupts do not have
 *  to be previously enabled.
 *
 *  @param[in]  aesadv         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_AESADV_INTERRUPT
 *
 *  @return     Which of the requested AESADV interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_AESADV_INTERRUPT
 */
__STATIC_INLINE uint32_t DL_AESADV_getRawInterruptStatus(
    AESADV_Regs *aesadv, uint32_t interruptMask)
{
    return (aesadv->CPU_INT.RIS & interruptMask);
}

/**
 *  @brief      Get highest priority pending AESADV interrupt
 *
 *  Checks if any AESADV interrupts are pending. Interrupt does not have to
 *  be previously enabled.
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 *
 *  @return     The highest priority pending AESADV interrupt
 *
 *  @retval     One of @ref DL_AESADV_IIDX
 */
__STATIC_INLINE DL_AESADV_IIDX DL_AESADV_getPendingInterrupt(
    AESADV_Regs *aesadv)
{
    return ((DL_AESADV_IIDX) aesadv->CPU_INT.IIDX);
}

/**
 *  @brief      Clear pending AESADV Interrupts
 *
 *  @param[in]  aesadv         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
 *                             @ref DL_AESADV_INTERRUPT
 */
__STATIC_INLINE void DL_AESADV_clearInterruptStatus(
    AESADV_Regs *aesadv, uint32_t interruptMask)
{
    aesadv->CPU_INT.ICLR = interruptMask;
}

/**
 *  @brief      Enables DMA input trigger to publish AESADV write requests to
 *              the DMA
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_enableDMAInputTriggerEvent(AESADV_Regs *aesadv)
{
    aesadv->DMA_TRIG_DATAIN.IMASK |= DL_AESADV_EVENT_DMA_DATA_INPUT_TRIGGER;
}

/**
 *  @brief      Enables DMA output trigger to publish AESADV read requests to
 *              the DMA
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_enableDMAOutputTriggerEvent(AESADV_Regs *aesadv)
{
    aesadv->DMA_TRIG_DATAOUT.IMASK |= DL_AESADV_EVENT_DMA_DATA_OUTPUT_TRIGGER;
}

/**
 *  @brief      Disable DMA input trigger event
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_disableDMAInputTriggerEvent(AESADV_Regs *aesadv)
{
    aesadv->DMA_TRIG_DATAIN.IMASK &= ~(DL_AESADV_EVENT_DMA_DATA_INPUT_TRIGGER);
}

/**
 *  @brief      Disable DMA output trigger event
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_disableDMAOutputTriggerEvent(
    AESADV_Regs *aesadv)
{
    aesadv->DMA_TRIG_DATAOUT.IMASK &=
        ~(DL_AESADV_EVENT_DMA_DATA_OUTPUT_TRIGGER);
}

/**
 *  @brief      Check if the DMA input trigger event is enabled
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 *
 *  @return     If DMA input trigger event is enabled
 *
 *  @retval     DL_AESADV_EVENT_DMA_DATA_INPUT_TRIGGER if DMA input trigger
 *              event is enabled
 *  @retval     0 if DMA input trigger event is not enabled
 */
__STATIC_INLINE uint32_t DL_AESADV_getEnabledDMAInputTriggerEvent(
    AESADV_Regs *aesadv)
{
    return (aesadv->DMA_TRIG_DATAIN.IMASK &
            DL_AESADV_EVENT_DMA_DATA_INPUT_TRIGGER);
}

/**
 *  @brief      Check if the DMA output trigger event is enabled
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 *
 *  @return     If DMA output trigger event is enabled
 *
 *  @retval     DL_AESADV_EVENT_DMA_DATA_OUTPUT_TRIGGER if DMA output trigger
 *              event is enabled
 *  @retval     0 if DMA output trigger event is not enabled
 */
__STATIC_INLINE uint32_t DL_AESADV_getEnabledDMAOutputTriggerEvent(
    AESADV_Regs *aesadv)
{
    return (aesadv->DMA_TRIG_DATAOUT.IMASK &
            DL_AESADV_EVENT_DMA_DATA_OUTPUT_TRIGGER);
}

/**
 *  @brief      Check interrupt flag of DMA input trigger event
 *
 *  Checks if DMA input trigger event that was previously enabled is pending.
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 *
 *  @return     If DMA input trigger event is pending
 *
 *  @retval     DL_AESADV_EVENT_DMA_DATA_INPUT_TRIGGER if DMA input trigger
 *              event is pending
 *  @retval     0 if DMA input trigger event is not pending
 *
 *  @sa         DL_AESADV_enableDMAInputTriggerEvent
 */
__STATIC_INLINE uint32_t DL_AESADV_getEnabledDMAInputTriggerEventStatus(
    AESADV_Regs *aesadv)
{
    return (
        aesadv->DMA_TRIG_DATAIN.MIS & DL_AESADV_EVENT_DMA_DATA_INPUT_TRIGGER);
}

/**
 *  @brief      Check interrupt flag of DMA output trigger event
 *
 *  Checks if DMA output trigger event that was previously enabled is pending.
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 *
 *  @return     If DMA output trigger event is pending
 *
 *  @retval     DL_AESADV_EVENT_DMA_DATA_OUTPUT_TRIGGER if DMA output trigger
 *              event is pending
 *  @retval     0 if DMA output trigger event is not pending
 *
 *  @sa         DL_AESADV_enableDMAOutputTriggerEvent
 */
__STATIC_INLINE uint32_t DL_AESADV_getEnabledDMAOutputTriggerEventStatus(
    AESADV_Regs *aesadv)
{
    return (aesadv->DMA_TRIG_DATAOUT.MIS &
            DL_AESADV_EVENT_DMA_DATA_OUTPUT_TRIGGER);
}

/**
 *  @brief      Check interrupt flag of DMA input trigger event
 *
 *  Checks if DMA input trigger event is pending. Event does not have to
 *  be previously enabled.
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 *
 *  @return     If DMA input trigger event is pending
 *
 *  @retval     DL_AESADV_EVENT_DMA_DATA_INPUT_TRIGGER if DMA input trigger event is
 *              pending
 *  @retval     0 if DMA input trigger event is not pending
 */
__STATIC_INLINE uint32_t DL_AESADV_getRawDMAInputTriggerEventStatus(
    AESADV_Regs *aesadv)
{
    return (
        aesadv->DMA_TRIG_DATAIN.RIS & DL_AESADV_EVENT_DMA_DATA_INPUT_TRIGGER);
}

/**
 *  @brief      Check interrupt flag of DMA output trigger event
 *
 *  Checks if DMA output trigger event is pending. Event does not have to
 *  be previously enabled.
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 *
 *  @return     If DMA output trigger event is pending
 *
 *  @retval     DL_AESADV_EVENT_DMA_DATA_INPUT_TRIGGER if DMA output trigger event is
 *              pending
 *  @retval     0 if DMA output trigger event is not pending
 */
__STATIC_INLINE uint32_t DL_AESADV_getRawDMAOutputTriggerEventStatus(
    AESADV_Regs *aesadv)
{
    return (aesadv->DMA_TRIG_DATAOUT.RIS &
            DL_AESADV_EVENT_DMA_DATA_OUTPUT_TRIGGER);
}

/**
 *  @brief      Get highest priority pending DMA input trigger event
 *
 *  Checks if DMA input trigger event is pending. Event does not have to
 *  be previously enabled.
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 *
 *  @return     The highest priority pending DMA input trigger event
 */
__STATIC_INLINE DL_AESADV_IIDX DL_AESADV_getPendingDMAInputTriggerEvent(
    AESADV_Regs *aesadv)
{
    uint32_t eventIIDX = aesadv->DMA_TRIG_DATAIN.IIDX;

    return (DL_AESADV_IIDX) eventIIDX;
}

/**
 *  @brief      Get highest priority pending DMA output trigger event
 *
 *  Checks if DMA output trigger event is pending. Event does not have to
 *  be previously enabled.
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 *
 *  @return     The highest priority pending DMA output trigger event
 */
__STATIC_INLINE DL_AESADV_IIDX DL_AESADV_getPendingDMAOutputTriggerEvent(
    AESADV_Regs *aesadv)
{
    uint32_t eventIIDX = aesadv->DMA_TRIG_DATAOUT.IIDX;

